#include<iostream>
using namespace std;
#define tab "\t"
void main()
{
	setlocale(LC_ALL, "");
	int a = 100;
	double b = 133.333;
	double c = 166.666;
	int d = 200;
	int x;
	cout << "–еальные частоты на которых работает люба€ пам€ть из категории SDRAM: " << endl;
	cout << a << tab << "Mhz" << endl;
	cout << b << tab << "Mhz" << endl;
	cout << c << tab << "Mhz" << endl;
	cout << d << tab << "Mhz" << endl;
	cout << "¬ведите номер поколени€ пам€ти DDR SDRAM - ";
	cin >> x;
	switch (x)
	{	
	case 1:cout << "Ёффективные частоты дл€ этого вида пам€ти: " << endl << a * 2 <<"Mhz" << tab<<tab << " ѕропускна€ способность" << " = " << tab << a * 2 * 8 << " бит в секунду" << endl << b * 2 << "Mhz" << tab << " ѕропускна€ способность" << " = " << tab << b * 2 * 8 << " бит в секунду" << endl << c * 2 << "Mhz" << tab << " ѕропускна€ способность" << " = " << tab << c * 2 * 8 << " бит в секунду" << endl << d * 2 << "Mhz" << tab <<tab << " ѕропускна€ способность" << " = " << tab << d * 2 * 8 << " бит в секунду" << endl; break;
	case 2:cout << "Ёффективные частоты дл€ этого вида пам€ти: " << endl << a * 4 <<"Mhz" << tab<<tab<< " ѕропускна€ способность" << " = " << tab << a * 4 * 8 << " бит в секунду" << endl << b * 4 << "Mhz" << tab << " ѕропускна€ способность" << " = " << tab << b * 4 * 8 << " бит в секунду" << endl << c * 4 << "Mhz" << tab << " ѕропускна€ способность" << " = " << tab << c * 4 * 8 << " бит в секунду" << endl << d * 4 << "Mhz" << tab <<tab<< " ѕропускна€ способность" << " = " << tab << d * 4 * 8 << " бит в секунду" << endl; break;
	case 3:cout << "Ёффективные частоты дл€ этого вида пам€ти: " << endl << a * 8 <<"Mhz" << tab <<tab<< " ѕропускна€ способность" << " = " << tab << a * 8 * 8 << " бит в секунду" << endl << b * 8 << "Mhz" << tab << " ѕропускна€ способность" << " = " << tab << b * 8 * 8 << " бит в секунду" << endl << c * 8 << "Mhz" << tab << " ѕропускна€ способность" << " = " << tab << c * 8 * 8 << " бит в секунду" << endl << d * 8 << "Mhz" << tab<<tab<< " ѕропускна€ способность" << " = " << tab << d * 8 * 8 << " бит в секунду" << endl; break;
	case 4:cout << "Ёффективные частоты дл€ этого вида пам€ти: " << endl << a * 16 <<"Mhz" << tab << tab<<" ѕропускна€ способность" << " = " << tab << a * 16 * 8 << " бит в секунду" << endl << b * 16 << "Mhz" << tab << " ѕропускна€ способность" << " = " << tab << b * 16 * 8 << " бит в секунду" << endl << c * 16 << "Mhz" << tab << " ѕропускна€ способность" << " = " << tab << c * 16 * 8 << " бит в секунду" << endl << d * 16 << "Mhz" << tab<<tab << " ѕропускна€ способность" << " = " << tab << d * 16 * 8 << " бит в секунду" << endl; break;
	case 5:cout << "Ёффективные частоты дл€ этого вида пам€ти: " << endl << a * 32 <<"Mhz" << tab << tab<<" ѕропускна€ способность" << " = " << tab << a * 32 * 8 << " бит в секунду" << endl << b * 32 << "Mhz" << tab << " ѕропускна€ способность" << " = " << tab << b * 32 * 8 << " бит в секунду" << endl << c * 32 << "Mhz" << tab << " ѕропускна€ способность" << " = " << tab << c * 32 * 8 << " бит в секунду" << endl << d * 32 << "Mhz" << tab <<tab<< " ѕропускна€ способность" << " = " << tab << d * 32 * 8 << " бит в секунду" << endl; break;	
	default: cout << endl << "“акого поколени€ пам€ти еще не существует!!!, подождите лет 10!!!   "<<endl;
	}
}